src/Documents/БазовыеРасценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>БазовыеРасценки</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.БазовыеРасценки</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>БазовыеРасценкиНаДату</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БазоваяРасценка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БазовыеРасценки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/БазовыеРасценки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>БазовыеРасценки</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ставка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БазоваяРасценка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БазовыеРасценки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Documents/БазовыеРасценки/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если БазовыеРасценкиНаДату.Количество() > 0 Тогда
		НаборЗаписей = РегистрыСведений.БазовыеРасценки.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить(Ссылка);
	Для Каждого Стр ИЗ БазовыеРасценкиНаДату Цикл
		Если ЗначениеЗаполнено(Стр.БазоваяРасценка) Тогда
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.Период	= НачалоДня(Дата);
			НоваяЗапись.Организация = Организация;
			НоваяЗапись.БазоваяРасценка = Стр.БазоваяРасценка;
			НоваяЗапись.Регистратор = Ссылка;
			НоваяЗапись.Ставка = Стр.Ставка;
		Иначе
			Сообщить("В строке " + СокрЛП(Стр.НомерСтроки) + " не заполнен реквизит ""Базовая расценка"". В регистр внесено не будет." );
		КонецЕсли;
	КонецЦикла;
	НаборЗаписей.Записать(Истина);

КонецЕсли;
КонецПроцедуры
